Ivansquark/stm32_proj/f407/f407_httpd/hal/src/stm32f4xx_hal_eth.cpp
    /* Set ETH HAL state to Disabled */
    heth->State = HAL_ETH_STATE_RESET;

    /* Release Lock */
    __HAL_UNLOCK(heth);

    /* Return function status */
    return HAL_OK;
}

/**
 * @brief  Initializes the DMA Tx descriptors in chain mode.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @param  DMATxDescTab Pointer to the first Tx desc list
 * @param  TxBuff Pointer to the first TxBuffer list
 * @param  TxBuffCount Number of the used Tx desc in the list
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_ETH_DMATxDescListInit(ETH_HandleTypeDef *heth, ETH_DMADescTypeDef *DMATxDescTab, uint8_t *TxBuff,
                                            uint32_t TxBuffCount) {
    uint32_t i = 0U;
    ETH_DMADescTypeDef *dmatxdesc;

    /* Process Locked */
    __HAL_LOCK(heth);

    /* Set the ETH peripheral state to BUSY */
    heth->State = HAL_ETH_STATE_BUSY;

    /* Set the DMATxDescToSet pointer with the first one of the DMATxDescTab list */
    heth->TxDesc = DMATxDescTab;

    /* Fill each DMATxDesc descriptor with the right values */
    for (i = 0U; i < TxBuffCount; i++) {
        /* Get the pointer on the ith member of the Tx Desc list */
        dmatxdesc = DMATxDescTab + i;

        /* Set Second Address Chained bit */
        dmatxdesc->Status = ETH_DMATXDESC_TCH;

        /* Set Buffer1 address pointer */
        dmatxdesc->Buffer1Addr = (uint32_t)(&TxBuff[i * ETH_TX_BUF_SIZE]);

        if ((heth->Init).ChecksumMode == ETH_CHECKSUM_BY_HARDWARE) {
            /* Set the DMA Tx descriptors checksum insertion */
            dmatxdesc->Status |= ETH_DMATXDESC_CHECKSUMTCPUDPICMPFULL;
        }

        /* Initialize the next descriptor with the Next Descriptor Polling Enable */
        if (i < (TxBuffCount - 1U)) {
            /* Set next descriptor address register with next descriptor base address */
            dmatxdesc->Buffer2NextDescAddr = (uint32_t)(DMATxDescTab + i + 1U);
        } else {
            /* For last descriptor, set next descriptor address register equal to the first descriptor base address */
            dmatxdesc->Buffer2NextDescAddr = (uint32_t)DMATxDescTab;
        }
    }

    /* Set Transmit Descriptor List Address Register */
    (heth->Instance)->DMATDLAR = (uint32_t)DMATxDescTab;

    /* Set ETH HAL State to Ready */
    heth->State = HAL_ETH_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(heth);

    /* Return function status */
    return HAL_OK;
}

/**
 * @brief  Initializes the DMA Rx descriptors in chain mode.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @param  DMARxDescTab Pointer to the first Rx desc list
 * @param  RxBuff Pointer to the first RxBuffer list
 * @param  RxBuffCount Number of the used Rx desc in the list
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_ETH_DMARxDescListInit(ETH_HandleTypeDef *heth, ETH_DMADescTypeDef *DMARxDescTab, uint8_t *RxBuff,
                                            uint32_t RxBuffCount) {
    uint32_t i = 0U;
    ETH_DMADescTypeDef *DMARxDesc;

    /* Process Locked */
    __HAL_LOCK(heth);

    /* Set the ETH peripheral state to BUSY */
    heth->State = HAL_ETH_STATE_BUSY;

    /* Set the Ethernet RxDesc pointer with the first one of the DMARxDescTab list */
    heth->RxDesc = DMARxDescTab;

    /* Fill each DMARxDesc descriptor with the right values */
    for (i = 0U; i < RxBuffCount; i++) {
        /* Get the pointer on the ith member of the Rx Desc list */
        DMARxDesc = DMARxDescTab + i;

        /* Set Own bit of the Rx descriptor Status */
        DMARxDesc->Status = ETH_DMARXDESC_OWN;

        /* Set Buffer1 size and Second Address Chained bit */
        DMARxDesc->ControlBufferSize = ETH_DMARXDESC_RCH | ETH_RX_BUF_SIZE;

        /* Set Buffer1 address pointer */
        DMARxDesc->Buffer1Addr = (uint32_t)(&RxBuff[i * ETH_RX_BUF_SIZE]);

        if ((heth->Init).RxMode == ETH_RXINTERRUPT_MODE) {
            /* Enable Ethernet DMA Rx Descriptor interrupt */
            DMARxDesc->ControlBufferSize &= ~ETH_DMARXDESC_DIC;
        }

        /* Initialize the next descriptor with the Next Descriptor Polling Enable */
        if (i < (RxBuffCount - 1U)) {
            /* Set next descriptor address register with next descriptor base address */
            DMARxDesc->Buffer2NextDescAddr = (uint32_t)(DMARxDescTab + i + 1U);
        } else {
            /* For last descriptor, set next descriptor address register equal to the first descriptor base address */
            DMARxDesc->Buffer2NextDescAddr = (uint32_t)(DMARxDescTab);
        }
    }

    /* Set Receive Descriptor List Address Register */
    (heth->Instance)->DMARDLAR = (uint32_t)DMARxDescTab;

    /* Set ETH HAL State to Ready */
    heth->State = HAL_ETH_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(heth);

    /* Return function status */
    return HAL_OK;
}

/**
 * @brief  Initializes the ETH MSP.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval None
 */
__weak void HAL_ETH_MspInit(ETH_HandleTypeDef *heth) {
    /* Prevent unused argument(s) compilation warning */
    UNUSED(heth);
    /* NOTE : This function Should not be modified, when the callback is needed,
    the HAL_ETH_MspInit could be implemented in the user file
    */
}

/**
 * @brief  DeInitializes ETH MSP.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval None
 */
__weak void HAL_ETH_MspDeInit(ETH_HandleTypeDef *heth) {
    /* Prevent unused argument(s) compilation warning */
    UNUSED(heth);
    /* NOTE : This function Should not be modified, when the callback is needed,
    the HAL_ETH_MspDeInit could be implemented in the user file
    */
}

#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
/**
 * @brief  Register a User ETH Callback
 *         To be used instead of the weak predefined callback
 * @param heth eth handle
 * @param CallbackID ID of the callback to be registered
 *        This parameter can be one of the following values:
 *          @arg @ref HAL_ETH_TX_COMPLETE_CB_ID Tx Complete Callback ID
 *          @arg @ref HAL_ETH_RX_COMPLETE_CB_ID Rx Complete Callback ID
 *          @arg @ref HAL_ETH_DMA_ERROR_CB_ID   DMA Error Callback ID
 *          @arg @ref HAL_ETH_MSPINIT_CB_ID     MspInit callback ID
 *          @arg @ref HAL_ETH_MSPDEINIT_CB_ID   MspDeInit callback ID
 * @param pCallback pointer to the Callback function
 * @retval status
 */
HAL_StatusTypeDef HAL_ETH_RegisterCallback(ETH_HandleTypeDef *heth, HAL_ETH_CallbackIDTypeDef CallbackID,
                                           pETH_CallbackTypeDef pCallback) {
    HAL_StatusTypeDef status = HAL_OK;

    if (pCallback == NULL) {
        return HAL_ERROR;
    }
    /* Process locked */
    __HAL_LOCK(heth);

    if (heth->State == HAL_ETH_STATE_READY) {
        switch (CallbackID) {
        case HAL_ETH_TX_COMPLETE_CB_ID:
            heth->TxCpltCallback = pCallback;
            break;

