Ivansquark/stm32_proj/f407/f407_httpd/hal/src/stm32f4xx_hal_eth.cpp
        case HAL_ETH_RX_COMPLETE_CB_ID:
            heth->RxCpltCallback = pCallback;
            break;

        case HAL_ETH_DMA_ERROR_CB_ID:
            heth->DMAErrorCallback = pCallback;
            break;

        case HAL_ETH_MSPINIT_CB_ID:
            heth->MspInitCallback = pCallback;
            break;

        case HAL_ETH_MSPDEINIT_CB_ID:
            heth->MspDeInitCallback = pCallback;
            break;

        default:
            /* Return error status */
            status = HAL_ERROR;
            break;
        }
    } else if (heth->State == HAL_ETH_STATE_RESET) {
        switch (CallbackID) {
        case HAL_ETH_MSPINIT_CB_ID:
            heth->MspInitCallback = pCallback;
            break;

        case HAL_ETH_MSPDEINIT_CB_ID:
            heth->MspDeInitCallback = pCallback;
            break;

        default:
            /* Return error status */
            status = HAL_ERROR;
            break;
        }
    } else {
        /* Return error status */
        status = HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(heth);

    return status;
}

/**
 * @brief  Unregister an ETH Callback
 *         ETH callabck is redirected to the weak predefined callback
 * @param heth eth handle
 * @param CallbackID ID of the callback to be unregistered
 *        This parameter can be one of the following values:
 *          @arg @ref HAL_ETH_TX_COMPLETE_CB_ID Tx Complete Callback ID
 *          @arg @ref HAL_ETH_RX_COMPLETE_CB_ID Rx Complete Callback ID
 *          @arg @ref HAL_ETH_DMA_ERROR_CB_ID      DMA Error Callback ID
 *          @arg @ref HAL_ETH_MSPINIT_CB_ID     MspInit callback ID
 *          @arg @ref HAL_ETH_MSPDEINIT_CB_ID   MspDeInit callback ID
 * @retval status
 */
HAL_StatusTypeDef HAL_ETH_UnRegisterCallback(ETH_HandleTypeDef *heth, HAL_ETH_CallbackIDTypeDef CallbackID) {
    HAL_StatusTypeDef status = HAL_OK;

    /* Process locked */
    __HAL_LOCK(heth);

    if (heth->State == HAL_ETH_STATE_READY) {
        switch (CallbackID) {
        case HAL_ETH_TX_COMPLETE_CB_ID:
            heth->TxCpltCallback = HAL_ETH_TxCpltCallback;
            break;

        case HAL_ETH_RX_COMPLETE_CB_ID:
            heth->RxCpltCallback = HAL_ETH_RxCpltCallback;
            break;

        case HAL_ETH_DMA_ERROR_CB_ID:
            heth->DMAErrorCallback = HAL_ETH_ErrorCallback;
            break;

        case HAL_ETH_MSPINIT_CB_ID:
            heth->MspInitCallback = HAL_ETH_MspInit;
            break;

        case HAL_ETH_MSPDEINIT_CB_ID:
            heth->MspDeInitCallback = HAL_ETH_MspDeInit;
            break;

        default:
            /* Return error status */
            status = HAL_ERROR;
            break;
        }
    } else if (heth->State == HAL_ETH_STATE_RESET) {
        switch (CallbackID) {
        case HAL_ETH_MSPINIT_CB_ID:
            heth->MspInitCallback = HAL_ETH_MspInit;
            break;

        case HAL_ETH_MSPDEINIT_CB_ID:
            heth->MspDeInitCallback = HAL_ETH_MspDeInit;
            break;

        default:
            /* Return error status */
            status = HAL_ERROR;
            break;
        }
    } else {
        /* Return error status */
        status = HAL_ERROR;
    }

    /* Release Lock */
    __HAL_UNLOCK(heth);

    return status;
}
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */

/**
 * @}
 */

/** @defgroup ETH_Exported_Functions_Group2 IO operation functions
  *  @brief   Data transfers functions
  *
  @verbatim
  ==============================================================================
                          ##### IO operation functions #####
  ==============================================================================
  [..]  This section provides functions allowing to:
        (+) Transmit a frame
            HAL_ETH_TransmitFrame();
        (+) Receive a frame
            HAL_ETH_GetReceivedFrame();
            HAL_ETH_GetReceivedFrame_IT();
        (+) Read from an External PHY register
            HAL_ETH_ReadPHYRegister();
        (+) Write to an External PHY register
            HAL_ETH_WritePHYRegister();

  @endverbatim

  * @{
  */

/**
 * @brief  Sends an Ethernet frame.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @param  FrameLength Amount of data to be sent
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_ETH_TransmitFrame(ETH_HandleTypeDef *heth, uint32_t FrameLength) {
    uint32_t bufcount = 0U, size = 0U, i = 0U;

    /* Process Locked */
    __HAL_LOCK(heth);

    /* Set the ETH peripheral state to BUSY */
    heth->State = HAL_ETH_STATE_BUSY;

    if (FrameLength == 0U) {
        /* Set ETH HAL state to READY */
        heth->State = HAL_ETH_STATE_READY;

        /* Process Unlocked */
        __HAL_UNLOCK(heth);

        return HAL_ERROR;
    }

    /* Check if the descriptor is owned by the ETHERNET DMA (when set) or CPU (when reset) */
    if (((heth->TxDesc)->Status & ETH_DMATXDESC_OWN) != (uint32_t)RESET) {
        /* OWN bit set */
        heth->State = HAL_ETH_STATE_BUSY_TX;

        /* Process Unlocked */
        __HAL_UNLOCK(heth);

        return HAL_ERROR;
    }

    /* Get the number of needed Tx buffers for the current frame */
    if (FrameLength > ETH_TX_BUF_SIZE) {
        bufcount = FrameLength / ETH_TX_BUF_SIZE;
        if (FrameLength % ETH_TX_BUF_SIZE) {
            bufcount++;
        }
    } else {
        bufcount = 1U;
    }
    if (bufcount == 1U) {
        /* Set LAST and FIRST segment */
        heth->TxDesc->Status |= ETH_DMATXDESC_FS | ETH_DMATXDESC_LS;
        /* Set frame size */
        heth->TxDesc->ControlBufferSize = (FrameLength & ETH_DMATXDESC_TBS1);
        /* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
        heth->TxDesc->Status |= ETH_DMATXDESC_OWN;
        /* Point to next descriptor */
        heth->TxDesc = (ETH_DMADescTypeDef *)(heth->TxDesc->Buffer2NextDescAddr);
    } else {
        for (i = 0U; i < bufcount; i++) {
            /* Clear FIRST and LAST segment bits */
            heth->TxDesc->Status &= ~(ETH_DMATXDESC_FS | ETH_DMATXDESC_LS);

            if (i == 0U) {
                /* Setting the first segment bit */
                heth->TxDesc->Status |= ETH_DMATXDESC_FS;
            }

            /* Program size */
            heth->TxDesc->ControlBufferSize = (ETH_TX_BUF_SIZE & ETH_DMATXDESC_TBS1);

            if (i == (bufcount - 1U)) {
                /* Setting the last segment bit */
                heth->TxDesc->Status |= ETH_DMATXDESC_LS;
                size = FrameLength - (bufcount - 1U) * ETH_TX_BUF_SIZE;
                heth->TxDesc->ControlBufferSize = (size & ETH_DMATXDESC_TBS1);
            }

