Ivansquark/stm32_proj/f407/f407_httpd/hal/src/stm32f4xx_hal_eth.cpp
            /* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
            heth->TxDesc->Status |= ETH_DMATXDESC_OWN;
            /* point to next descriptor */
            heth->TxDesc = (ETH_DMADescTypeDef *)(heth->TxDesc->Buffer2NextDescAddr);
        }
    }

    /* When Tx Buffer unavailable flag is set: clear it and resume transmission */
    if (((heth->Instance)->DMASR & ETH_DMASR_TBUS) != (uint32_t)RESET) {
        /* Clear TBUS ETHERNET DMA flag */
        (heth->Instance)->DMASR = ETH_DMASR_TBUS;
        /* Resume DMA transmission*/
        (heth->Instance)->DMATPDR = 0U;
    }

    /* Set ETH HAL State to Ready */
    heth->State = HAL_ETH_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(heth);

    /* Return function status */
    return HAL_OK;
}

/**
 * @brief  Checks for received frames.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_ETH_GetReceivedFrame(ETH_HandleTypeDef *heth) {
    uint32_t framelength = 0U;

    /* Process Locked */
    __HAL_LOCK(heth);

    /* Check the ETH state to BUSY */
    heth->State = HAL_ETH_STATE_BUSY;

    /* Check if segment is not owned by DMA */
    /* (((heth->RxDesc->Status & ETH_DMARXDESC_OWN) == (uint32_t)RESET) && ((heth->RxDesc->Status & ETH_DMARXDESC_LS) !=
     * (uint32_t)RESET)) */
    if (((heth->RxDesc->Status & ETH_DMARXDESC_OWN) == (uint32_t)RESET)) {
        /* Check if last segment */
        if (((heth->RxDesc->Status & ETH_DMARXDESC_LS) != (uint32_t)RESET)) {
            /* increment segment count */
            (heth->RxFrameInfos).SegCount++;

            /* Check if last segment is first segment: one segment contains the frame */
            if ((heth->RxFrameInfos).SegCount == 1U) {
                (heth->RxFrameInfos).FSRxDesc = heth->RxDesc;
            }

            heth->RxFrameInfos.LSRxDesc = heth->RxDesc;

            /* Get the Frame Length of the received packet: substruct 4 bytes of the CRC */
            framelength = (((heth->RxDesc)->Status & ETH_DMARXDESC_FL) >> ETH_DMARXDESC_FRAMELENGTHSHIFT) - 4U;
            heth->RxFrameInfos.length = framelength;

            /* Get the address of the buffer start address */
            heth->RxFrameInfos.buffer = ((heth->RxFrameInfos).FSRxDesc)->Buffer1Addr;
            /* point to next descriptor */
            heth->RxDesc = (ETH_DMADescTypeDef *)((heth->RxDesc)->Buffer2NextDescAddr);

            /* Set HAL State to Ready */
            heth->State = HAL_ETH_STATE_READY;

            /* Process Unlocked */
            __HAL_UNLOCK(heth);

            /* Return function status */
            return HAL_OK;
        }
        /* Check if first segment */
        else if ((heth->RxDesc->Status & ETH_DMARXDESC_FS) != (uint32_t)RESET) {
            (heth->RxFrameInfos).FSRxDesc = heth->RxDesc;
            (heth->RxFrameInfos).LSRxDesc = NULL;
            (heth->RxFrameInfos).SegCount = 1U;
            /* Point to next descriptor */
            heth->RxDesc = (ETH_DMADescTypeDef *)(heth->RxDesc->Buffer2NextDescAddr);
        }
        /* Check if intermediate segment */
        else {
            (heth->RxFrameInfos).SegCount++;
            /* Point to next descriptor */
            heth->RxDesc = (ETH_DMADescTypeDef *)(heth->RxDesc->Buffer2NextDescAddr);
        }
    }

    /* Set ETH HAL State to Ready */
    heth->State = HAL_ETH_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(heth);

    /* Return function status */
    return HAL_ERROR;
}

/**
 * @brief  Gets the Received frame in interrupt mode.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_ETH_GetReceivedFrame_IT(ETH_HandleTypeDef *heth) {
    uint32_t descriptorscancounter = 0U;

    /* Process Locked */
    __HAL_LOCK(heth);

    /* Set ETH HAL State to BUSY */
    heth->State = HAL_ETH_STATE_BUSY;

    /* Scan descriptors owned by CPU */
    while (((heth->RxDesc->Status & ETH_DMARXDESC_OWN) == (uint32_t)RESET) && (descriptorscancounter < ETH_RXBUFNB)) {
        /* Just for security */
        descriptorscancounter++;

        /* Check if first segment in frame */
        /* ((heth->RxDesc->Status & ETH_DMARXDESC_FS) != (uint32_t)RESET) && ((heth->RxDesc->Status & ETH_DMARXDESC_LS)
         * == (uint32_t)RESET)) */
        if ((heth->RxDesc->Status & (ETH_DMARXDESC_FS | ETH_DMARXDESC_LS)) == (uint32_t)ETH_DMARXDESC_FS) {
            heth->RxFrameInfos.FSRxDesc = heth->RxDesc;
            heth->RxFrameInfos.SegCount = 1U;
            /* Point to next descriptor */
            heth->RxDesc = (ETH_DMADescTypeDef *)(heth->RxDesc->Buffer2NextDescAddr);
        }
        /* Check if intermediate segment */
        /* ((heth->RxDesc->Status & ETH_DMARXDESC_LS) == (uint32_t)RESET)&& ((heth->RxDesc->Status & ETH_DMARXDESC_FS)
           == (uint32_t)RESET)) */
        else if ((heth->RxDesc->Status & (ETH_DMARXDESC_LS | ETH_DMARXDESC_FS)) == (uint32_t)RESET) {
            /* Increment segment count */
            (heth->RxFrameInfos.SegCount)++;
            /* Point to next descriptor */
            heth->RxDesc = (ETH_DMADescTypeDef *)(heth->RxDesc->Buffer2NextDescAddr);
        }
        /* Should be last segment */
        else {
            /* Last segment */
            heth->RxFrameInfos.LSRxDesc = heth->RxDesc;

            /* Increment segment count */
            (heth->RxFrameInfos.SegCount)++;

            /* Check if last segment is first segment: one segment contains the frame */
            if ((heth->RxFrameInfos.SegCount) == 1U) {
                heth->RxFrameInfos.FSRxDesc = heth->RxDesc;
            }

            /* Get the Frame Length of the received packet: substruct 4 bytes of the CRC */
            heth->RxFrameInfos.length =
                (((heth->RxDesc)->Status & ETH_DMARXDESC_FL) >> ETH_DMARXDESC_FRAMELENGTHSHIFT) - 4U;

