Ivansquark/stm32_proj/f407/f407_httpd/hal/src/stm32f4xx_hal_eth.cpp
            /* Get the address of the buffer start address */
            heth->RxFrameInfos.buffer = ((heth->RxFrameInfos).FSRxDesc)->Buffer1Addr;

            /* Point to next descriptor */
            heth->RxDesc = (ETH_DMADescTypeDef *)(heth->RxDesc->Buffer2NextDescAddr);

            /* Set HAL State to Ready */
            heth->State = HAL_ETH_STATE_READY;

            /* Process Unlocked */
            __HAL_UNLOCK(heth);

            /* Return function status */
            return HAL_OK;
        }
    }

    /* Set HAL State to Ready */
    heth->State = HAL_ETH_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(heth);

    /* Return function status */
    return HAL_ERROR;
}

/**
 * @brief  This function handles ETH interrupt request.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval HAL status
 */
void HAL_ETH_IRQHandler(ETH_HandleTypeDef *heth) {
    /* Frame received */
    if (__HAL_ETH_DMA_GET_FLAG(heth, ETH_DMA_FLAG_R)) {
#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
        /*Call registered Receive complete callback*/
        heth->RxCpltCallback(heth);
#else
        /* Receive complete callback */
        HAL_ETH_RxCpltCallback(heth);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */

        /* Clear the Eth DMA Rx IT pending bits */
        __HAL_ETH_DMA_CLEAR_IT(heth, ETH_DMA_IT_R);

        /* Set HAL State to Ready */
        heth->State = HAL_ETH_STATE_READY;

        /* Process Unlocked */
        __HAL_UNLOCK(heth);

    }
    /* Frame transmitted */
    else if (__HAL_ETH_DMA_GET_FLAG(heth, ETH_DMA_FLAG_T)) {
#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
        /*  Call resgistered Transfer complete callback*/
        heth->TxCpltCallback(heth);
#else
        /* Transfer complete callback */
        HAL_ETH_TxCpltCallback(heth);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */

        /* Clear the Eth DMA Tx IT pending bits */
        __HAL_ETH_DMA_CLEAR_IT(heth, ETH_DMA_IT_T);

        /* Set HAL State to Ready */
        heth->State = HAL_ETH_STATE_READY;

        /* Process Unlocked */
        __HAL_UNLOCK(heth);
    }

    /* Clear the interrupt flags */
    __HAL_ETH_DMA_CLEAR_IT(heth, ETH_DMA_IT_NIS);

    /* ETH DMA Error */
    if (__HAL_ETH_DMA_GET_FLAG(heth, ETH_DMA_FLAG_AIS)) {
#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
        heth->DMAErrorCallback(heth);
#else
        /* Ethernet Error callback */
        HAL_ETH_ErrorCallback(heth);
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */

        /* Clear the interrupt flags */
        __HAL_ETH_DMA_CLEAR_IT(heth, ETH_DMA_FLAG_AIS);

        /* Set HAL State to Ready */
        heth->State = HAL_ETH_STATE_READY;

        /* Process Unlocked */
        __HAL_UNLOCK(heth);
    }
}

/**
 * @brief  Tx Transfer completed callbacks.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval None
 */
__weak void HAL_ETH_TxCpltCallback(ETH_HandleTypeDef *heth) {
    /* Prevent unused argument(s) compilation warning */
    UNUSED(heth);
    /* NOTE : This function Should not be modified, when the callback is needed,
    the HAL_ETH_TxCpltCallback could be implemented in the user file
    */
}

/**
 * @brief  Rx Transfer completed callbacks.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval None
 */
__weak void HAL_ETH_RxCpltCallback(ETH_HandleTypeDef *heth) {
    /* Prevent unused argument(s) compilation warning */
    UNUSED(heth);
    /* NOTE : This function Should not be modified, when the callback is needed,
    the HAL_ETH_TxCpltCallback could be implemented in the user file
    */
}

/**
 * @brief  Ethernet transfer error callbacks
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval None
 */
__weak void HAL_ETH_ErrorCallback(ETH_HandleTypeDef *heth) {
    /* Prevent unused argument(s) compilation warning */
    UNUSED(heth);
    /* NOTE : This function Should not be modified, when the callback is needed,
    the HAL_ETH_TxCpltCallback could be implemented in the user file
    */
}

/**
 * @brief  Reads a PHY register
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @param PHYReg PHY register address, is the index of one of the 32 PHY register.
 *                This parameter can be one of the following values:
 *                   PHY_BCR: Transceiver Basic Control Register,
 *                   PHY_BSR: Transceiver Basic Status Register.
 *                   More PHY register could be read depending on the used PHY
 * @param RegValue PHY register value
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_ETH_ReadPHYRegister(ETH_HandleTypeDef *heth, uint16_t PHYReg, uint32_t *RegValue) {
    uint32_t tmpreg1 = 0U;
    uint32_t tickstart = 0U;

    /* Check parameters */
    assert_param(IS_ETH_PHY_ADDRESS(heth->Init.PhyAddress));

    /* Check the ETH peripheral state */
    if (heth->State == HAL_ETH_STATE_BUSY_RD) {
        return HAL_BUSY;
    }
    /* Set ETH HAL State to BUSY_RD */
    heth->State = HAL_ETH_STATE_BUSY_RD;

    /* Get the ETHERNET MACMIIAR value */
    tmpreg1 = heth->Instance->MACMIIAR;

    /* Keep only the CSR Clock Range CR[2:0] bits value */
    tmpreg1 &= ~ETH_MACMIIAR_CR_MASK;

    /* Prepare the MII address register value */
    tmpreg1 |= (((uint32_t)heth->Init.PhyAddress << 11U) & ETH_MACMIIAR_PA); /* Set the PHY device address   */
    tmpreg1 |= (((uint32_t)PHYReg << 6U) & ETH_MACMIIAR_MR);                 /* Set the PHY register address */
    tmpreg1 &= ~ETH_MACMIIAR_MW;                                             /* Set the read mode            */
    tmpreg1 |= ETH_MACMIIAR_MB;                                              /* Set the MII Busy bit         */

    /* Write the result value into the MII Address register */
    heth->Instance->MACMIIAR = tmpreg1;

    /* Get tick */
    tickstart = HAL_GetTick();

