Ivansquark/stm32_proj/f407/f407_httpd/hal/src/stm32f4xx_hal_eth.cpp
    /* Check for the Busy flag */
    while ((tmpreg1 & ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB) {
        /* Check for the Timeout */
        if ((HAL_GetTick() - tickstart) > PHY_READ_TO) {
            heth->State = HAL_ETH_STATE_READY;

            /* Process Unlocked */
            __HAL_UNLOCK(heth);

            return HAL_TIMEOUT;
        }

        tmpreg1 = heth->Instance->MACMIIAR;
    }

    /* Get MACMIIDR value */
    *RegValue = (uint16_t)(heth->Instance->MACMIIDR);

    /* Set ETH HAL State to READY */
    heth->State = HAL_ETH_STATE_READY;

    /* Return function status */
    return HAL_OK;
}

/**
 * @brief  Writes to a PHY register.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @param  PHYReg PHY register address, is the index of one of the 32 PHY register.
 *          This parameter can be one of the following values:
 *             PHY_BCR: Transceiver Control Register.
 *             More PHY register could be written depending on the used PHY
 * @param  RegValue the value to write
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_ETH_WritePHYRegister(ETH_HandleTypeDef *heth, uint16_t PHYReg, uint32_t RegValue) {
    uint32_t tmpreg1 = 0U;
    uint32_t tickstart = 0U;

    /* Check parameters */
    assert_param(IS_ETH_PHY_ADDRESS(heth->Init.PhyAddress));

    /* Check the ETH peripheral state */
    if (heth->State == HAL_ETH_STATE_BUSY_WR) {
        return HAL_BUSY;
    }
    /* Set ETH HAL State to BUSY_WR */
    heth->State = HAL_ETH_STATE_BUSY_WR;

    /* Get the ETHERNET MACMIIAR value */
    tmpreg1 = heth->Instance->MACMIIAR;

    /* Keep only the CSR Clock Range CR[2:0] bits value */
    tmpreg1 &= ~ETH_MACMIIAR_CR_MASK;

    /* Prepare the MII register address value */
    tmpreg1 |= (((uint32_t)heth->Init.PhyAddress << 11U) & ETH_MACMIIAR_PA); /* Set the PHY device address */
    tmpreg1 |= (((uint32_t)PHYReg << 6U) & ETH_MACMIIAR_MR);                 /* Set the PHY register address */
    tmpreg1 |= ETH_MACMIIAR_MW;                                              /* Set the write mode */
    tmpreg1 |= ETH_MACMIIAR_MB;                                              /* Set the MII Busy bit */

    /* Give the value to the MII data register */
    heth->Instance->MACMIIDR = (uint16_t)RegValue;

    /* Write the result value into the MII Address register */
    heth->Instance->MACMIIAR = tmpreg1;

    /* Get tick */
    tickstart = HAL_GetTick();

    /* Check for the Busy flag */
    while ((tmpreg1 & ETH_MACMIIAR_MB) == ETH_MACMIIAR_MB) {
        /* Check for the Timeout */
        if ((HAL_GetTick() - tickstart) > PHY_WRITE_TO) {
            heth->State = HAL_ETH_STATE_READY;

            /* Process Unlocked */
            __HAL_UNLOCK(heth);

            return HAL_TIMEOUT;
        }

        tmpreg1 = heth->Instance->MACMIIAR;
    }

    /* Set ETH HAL State to READY */
    heth->State = HAL_ETH_STATE_READY;

    /* Return function status */
    return HAL_OK;
}

/**
 * @}
 */

/** @defgroup ETH_Exported_Functions_Group3 Peripheral Control functions
 *  @brief    Peripheral Control functions
 *
@verbatim
 ===============================================================================
                  ##### Peripheral Control functions #####
 ===============================================================================
    [..]  This section provides functions allowing to:
      (+) Enable MAC and DMA transmission and reception.
          HAL_ETH_Start();
      (+) Disable MAC and DMA transmission and reception.
          HAL_ETH_Stop();
      (+) Set the MAC configuration in runtime mode
          HAL_ETH_ConfigMAC();
      (+) Set the DMA configuration in runtime mode
          HAL_ETH_ConfigDMA();

@endverbatim
  * @{
  */

/**
 * @brief  Enables Ethernet MAC and DMA reception/transmission
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_ETH_Start(ETH_HandleTypeDef *heth) {
    /* Process Locked */
    __HAL_LOCK(heth);

    /* Set the ETH peripheral state to BUSY */
    heth->State = HAL_ETH_STATE_BUSY;

    /* Enable transmit state machine of the MAC for transmission on the MII */
    ETH_MACTransmissionEnable(heth);

    /* Enable receive state machine of the MAC for reception from the MII */
    ETH_MACReceptionEnable(heth);

    /* Flush Transmit FIFO */
    ETH_FlushTransmitFIFO(heth);

    /* Start DMA transmission */
    ETH_DMATransmissionEnable(heth);

    /* Start DMA reception */
    ETH_DMAReceptionEnable(heth);

    /* Set the ETH state to READY*/
    heth->State = HAL_ETH_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(heth);

    /* Return function status */
    return HAL_OK;
}

/**
 * @brief  Stop Ethernet MAC and DMA reception/transmission
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_ETH_Stop(ETH_HandleTypeDef *heth) {
    /* Process Locked */
    __HAL_LOCK(heth);

    /* Set the ETH peripheral state to BUSY */
    heth->State = HAL_ETH_STATE_BUSY;

    /* Stop DMA transmission */
    ETH_DMATransmissionDisable(heth);

    /* Stop DMA reception */
    ETH_DMAReceptionDisable(heth);

    /* Disable receive state machine of the MAC for reception from the MII */
    ETH_MACReceptionDisable(heth);

    /* Flush Transmit FIFO */
    ETH_FlushTransmitFIFO(heth);

    /* Disable transmit state machine of the MAC for transmission on the MII */
    ETH_MACTransmissionDisable(heth);

    /* Set the ETH state*/
    heth->State = HAL_ETH_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(heth);

    /* Return function status */
    return HAL_OK;
}

/**
 * @brief  Set ETH MAC Configuration.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @param  macconf MAC Configuration structure
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_ETH_ConfigMAC(ETH_HandleTypeDef *heth, ETH_MACInitTypeDef *macconf) {
    uint32_t tmpreg1 = 0U;

    /* Process Locked */
    __HAL_LOCK(heth);

