Ivansquark/stm32_proj/f407/f407_httpd/hal/src/stm32f4xx_hal_eth.cpp
    /* Set the ETH peripheral state to BUSY */
    heth->State = HAL_ETH_STATE_BUSY;

    assert_param(IS_ETH_SPEED(heth->Init.Speed));
    assert_param(IS_ETH_DUPLEX_MODE(heth->Init.DuplexMode));

    if (macconf != NULL) {
        /* Check the parameters */
        assert_param(IS_ETH_WATCHDOG(macconf->Watchdog));
        assert_param(IS_ETH_JABBER(macconf->Jabber));
        assert_param(IS_ETH_INTER_FRAME_GAP(macconf->InterFrameGap));
        assert_param(IS_ETH_CARRIER_SENSE(macconf->CarrierSense));
        assert_param(IS_ETH_RECEIVE_OWN(macconf->ReceiveOwn));
        assert_param(IS_ETH_LOOPBACK_MODE(macconf->LoopbackMode));
        assert_param(IS_ETH_CHECKSUM_OFFLOAD(macconf->ChecksumOffload));
        assert_param(IS_ETH_RETRY_TRANSMISSION(macconf->RetryTransmission));
        assert_param(IS_ETH_AUTOMATIC_PADCRC_STRIP(macconf->AutomaticPadCRCStrip));
        assert_param(IS_ETH_BACKOFF_LIMIT(macconf->BackOffLimit));
        assert_param(IS_ETH_DEFERRAL_CHECK(macconf->DeferralCheck));
        assert_param(IS_ETH_RECEIVE_ALL(macconf->ReceiveAll));
        assert_param(IS_ETH_SOURCE_ADDR_FILTER(macconf->SourceAddrFilter));
        assert_param(IS_ETH_CONTROL_FRAMES(macconf->PassControlFrames));
        assert_param(IS_ETH_BROADCAST_FRAMES_RECEPTION(macconf->BroadcastFramesReception));
        assert_param(IS_ETH_DESTINATION_ADDR_FILTER(macconf->DestinationAddrFilter));
        assert_param(IS_ETH_PROMISCUOUS_MODE(macconf->PromiscuousMode));
        assert_param(IS_ETH_MULTICAST_FRAMES_FILTER(macconf->MulticastFramesFilter));
        assert_param(IS_ETH_UNICAST_FRAMES_FILTER(macconf->UnicastFramesFilter));
        assert_param(IS_ETH_PAUSE_TIME(macconf->PauseTime));
        assert_param(IS_ETH_ZEROQUANTA_PAUSE(macconf->ZeroQuantaPause));
        assert_param(IS_ETH_PAUSE_LOW_THRESHOLD(macconf->PauseLowThreshold));
        assert_param(IS_ETH_UNICAST_PAUSE_FRAME_DETECT(macconf->UnicastPauseFrameDetect));
        assert_param(IS_ETH_RECEIVE_FLOWCONTROL(macconf->ReceiveFlowControl));
        assert_param(IS_ETH_TRANSMIT_FLOWCONTROL(macconf->TransmitFlowControl));
        assert_param(IS_ETH_VLAN_TAG_COMPARISON(macconf->VLANTagComparison));
        assert_param(IS_ETH_VLAN_TAG_IDENTIFIER(macconf->VLANTagIdentifier));

        /*------------------------ ETHERNET MACCR Configuration --------------------*/
        /* Get the ETHERNET MACCR value */
        tmpreg1 = (heth->Instance)->MACCR;
        /* Clear WD, PCE, PS, TE and RE bits */
        tmpreg1 &= ETH_MACCR_CLEAR_MASK;

        tmpreg1 |= (uint32_t)(macconf->Watchdog | macconf->Jabber | macconf->InterFrameGap | macconf->CarrierSense |
                              (heth->Init).Speed | macconf->ReceiveOwn | macconf->LoopbackMode |
                              (heth->Init).DuplexMode | macconf->ChecksumOffload | macconf->RetryTransmission |
                              macconf->AutomaticPadCRCStrip | macconf->BackOffLimit | macconf->DeferralCheck);

        /* Write to ETHERNET MACCR */
        (heth->Instance)->MACCR = (uint32_t)tmpreg1;

        /* Wait until the write operation will be taken into account :
        at least four TX_CLK/RX_CLK clock cycles */
        tmpreg1 = (heth->Instance)->MACCR;
        HAL_Delay(ETH_REG_WRITE_DELAY);
        (heth->Instance)->MACCR = tmpreg1;

        /*----------------------- ETHERNET MACFFR Configuration --------------------*/
        /* Write to ETHERNET MACFFR */
        (heth->Instance)->MACFFR =
            (uint32_t)(macconf->ReceiveAll | macconf->SourceAddrFilter | macconf->PassControlFrames |
                       macconf->BroadcastFramesReception | macconf->DestinationAddrFilter | macconf->PromiscuousMode |
                       macconf->MulticastFramesFilter | macconf->UnicastFramesFilter);

        /* Wait until the write operation will be taken into account :
        at least four TX_CLK/RX_CLK clock cycles */
        tmpreg1 = (heth->Instance)->MACFFR;
        HAL_Delay(ETH_REG_WRITE_DELAY);
        (heth->Instance)->MACFFR = tmpreg1;

        /*--------------- ETHERNET MACHTHR and MACHTLR Configuration ---------------*/
        /* Write to ETHERNET MACHTHR */
        (heth->Instance)->MACHTHR = (uint32_t)macconf->HashTableHigh;

        /* Write to ETHERNET MACHTLR */
        (heth->Instance)->MACHTLR = (uint32_t)macconf->HashTableLow;
        /*----------------------- ETHERNET MACFCR Configuration --------------------*/

        /* Get the ETHERNET MACFCR value */
        tmpreg1 = (heth->Instance)->MACFCR;
        /* Clear xx bits */
        tmpreg1 &= ETH_MACFCR_CLEAR_MASK;

        tmpreg1 |=
            (uint32_t)((macconf->PauseTime << 16U) | macconf->ZeroQuantaPause | macconf->PauseLowThreshold |
                       macconf->UnicastPauseFrameDetect | macconf->ReceiveFlowControl | macconf->TransmitFlowControl);

        /* Write to ETHERNET MACFCR */
        (heth->Instance)->MACFCR = (uint32_t)tmpreg1;

        /* Wait until the write operation will be taken into account :
        at least four TX_CLK/RX_CLK clock cycles */
        tmpreg1 = (heth->Instance)->MACFCR;
        HAL_Delay(ETH_REG_WRITE_DELAY);
        (heth->Instance)->MACFCR = tmpreg1;

        /*----------------------- ETHERNET MACVLANTR Configuration -----------------*/
        (heth->Instance)->MACVLANTR = (uint32_t)(macconf->VLANTagComparison | macconf->VLANTagIdentifier);

        /* Wait until the write operation will be taken into account :
        at least four TX_CLK/RX_CLK clock cycles */
        tmpreg1 = (heth->Instance)->MACVLANTR;
        HAL_Delay(ETH_REG_WRITE_DELAY);
        (heth->Instance)->MACVLANTR = tmpreg1;
    } else /* macconf == NULL : here we just configure Speed and Duplex mode */
    {
        /*------------------------ ETHERNET MACCR Configuration --------------------*/
        /* Get the ETHERNET MACCR value */
        tmpreg1 = (heth->Instance)->MACCR;

        /* Clear FES and DM bits */
        tmpreg1 &= ~(0x00004800U);

        tmpreg1 |= (uint32_t)(heth->Init.Speed | heth->Init.DuplexMode);

