Ivansquark/stm32_proj/f407/f407_httpd/hal/src/stm32f4xx_hal_eth.cpp
        /* Write to ETHERNET MACCR */
        (heth->Instance)->MACCR = (uint32_t)tmpreg1;

        /* Wait until the write operation will be taken into account:
        at least four TX_CLK/RX_CLK clock cycles */
        tmpreg1 = (heth->Instance)->MACCR;
        HAL_Delay(ETH_REG_WRITE_DELAY);
        (heth->Instance)->MACCR = tmpreg1;
    }

    /* Set the ETH state to Ready */
    heth->State = HAL_ETH_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(heth);

    /* Return function status */
    return HAL_OK;
}

/**
 * @brief  Sets ETH DMA Configuration.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @param  dmaconf DMA Configuration structure
 * @retval HAL status
 */
HAL_StatusTypeDef HAL_ETH_ConfigDMA(ETH_HandleTypeDef *heth, ETH_DMAInitTypeDef *dmaconf) {
    uint32_t tmpreg1 = 0U;

    /* Process Locked */
    __HAL_LOCK(heth);

    /* Set the ETH peripheral state to BUSY */
    heth->State = HAL_ETH_STATE_BUSY;

    /* Check parameters */
    assert_param(IS_ETH_DROP_TCPIP_CHECKSUM_FRAME(dmaconf->DropTCPIPChecksumErrorFrame));
    assert_param(IS_ETH_RECEIVE_STORE_FORWARD(dmaconf->ReceiveStoreForward));
    assert_param(IS_ETH_FLUSH_RECEIVE_FRAME(dmaconf->FlushReceivedFrame));
    assert_param(IS_ETH_TRANSMIT_STORE_FORWARD(dmaconf->TransmitStoreForward));
    assert_param(IS_ETH_TRANSMIT_THRESHOLD_CONTROL(dmaconf->TransmitThresholdControl));
    assert_param(IS_ETH_FORWARD_ERROR_FRAMES(dmaconf->ForwardErrorFrames));
    assert_param(IS_ETH_FORWARD_UNDERSIZED_GOOD_FRAMES(dmaconf->ForwardUndersizedGoodFrames));
    assert_param(IS_ETH_RECEIVE_THRESHOLD_CONTROL(dmaconf->ReceiveThresholdControl));
    assert_param(IS_ETH_SECOND_FRAME_OPERATE(dmaconf->SecondFrameOperate));
    assert_param(IS_ETH_ADDRESS_ALIGNED_BEATS(dmaconf->AddressAlignedBeats));
    assert_param(IS_ETH_FIXED_BURST(dmaconf->FixedBurst));
    assert_param(IS_ETH_RXDMA_BURST_LENGTH(dmaconf->RxDMABurstLength));
    assert_param(IS_ETH_TXDMA_BURST_LENGTH(dmaconf->TxDMABurstLength));
    assert_param(IS_ETH_ENHANCED_DESCRIPTOR_FORMAT(dmaconf->EnhancedDescriptorFormat));
    assert_param(IS_ETH_DMA_DESC_SKIP_LENGTH(dmaconf->DescriptorSkipLength));
    assert_param(IS_ETH_DMA_ARBITRATION_ROUNDROBIN_RXTX(dmaconf->DMAArbitration));

    /*----------------------- ETHERNET DMAOMR Configuration --------------------*/
    /* Get the ETHERNET DMAOMR value */
    tmpreg1 = (heth->Instance)->DMAOMR;
    /* Clear xx bits */
    tmpreg1 &= ETH_DMAOMR_CLEAR_MASK;

    tmpreg1 |=
        (uint32_t)(dmaconf->DropTCPIPChecksumErrorFrame | dmaconf->ReceiveStoreForward | dmaconf->FlushReceivedFrame |
                   dmaconf->TransmitStoreForward | dmaconf->TransmitThresholdControl | dmaconf->ForwardErrorFrames |
                   dmaconf->ForwardUndersizedGoodFrames | dmaconf->ReceiveThresholdControl |
                   dmaconf->SecondFrameOperate);

    /* Write to ETHERNET DMAOMR */
    (heth->Instance)->DMAOMR = (uint32_t)tmpreg1;

    /* Wait until the write operation will be taken into account:
    at least four TX_CLK/RX_CLK clock cycles */
    tmpreg1 = (heth->Instance)->DMAOMR;
    HAL_Delay(ETH_REG_WRITE_DELAY);
    (heth->Instance)->DMAOMR = tmpreg1;

    /*----------------------- ETHERNET DMABMR Configuration --------------------*/
    (heth->Instance)->DMABMR =
        (uint32_t)(dmaconf->AddressAlignedBeats | dmaconf->FixedBurst |
                   dmaconf->RxDMABurstLength | /* !! if 4xPBL is selected for Tx or Rx it is applied for the other */
                   dmaconf->TxDMABurstLength | dmaconf->EnhancedDescriptorFormat |
                   (dmaconf->DescriptorSkipLength << 2U) | dmaconf->DMAArbitration |
                   ETH_DMABMR_USP); /* Enable use of separate PBL for Rx and Tx */

    /* Wait until the write operation will be taken into account:
       at least four TX_CLK/RX_CLK clock cycles */
    tmpreg1 = (heth->Instance)->DMABMR;
    HAL_Delay(ETH_REG_WRITE_DELAY);
    (heth->Instance)->DMABMR = tmpreg1;

    /* Set the ETH state to Ready */
    heth->State = HAL_ETH_STATE_READY;

    /* Process Unlocked */
    __HAL_UNLOCK(heth);

    /* Return function status */
    return HAL_OK;
}

/**
 * @}
 */

/** @defgroup ETH_Exported_Functions_Group4 Peripheral State functions
  *  @brief   Peripheral State functions
  *
  @verbatim
  ===============================================================================
                         ##### Peripheral State functions #####
  ===============================================================================
  [..]
  This subsection permits to get in run-time the status of the peripheral
  and the data flow.
       (+) Get the ETH handle state:
           HAL_ETH_GetState();


  @endverbatim
  * @{
  */

/**
 * @brief  Return the ETH HAL state
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval HAL state
 */
HAL_ETH_StateTypeDef HAL_ETH_GetState(ETH_HandleTypeDef *heth) {
    /* Return ETH state */
    return heth->State;
}

/**
 * @}
 */

/**
 * @}
 */

/** @addtogroup ETH_Private_Functions
 * @{
 */

/**
 * @brief  Configures Ethernet MAC and DMA with default parameters.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @param  err Ethernet Init error
 * @retval HAL status
 */
static void ETH_MACDMAConfig(ETH_HandleTypeDef *heth, uint32_t err) {
    ETH_MACInitTypeDef macinit;
    ETH_DMAInitTypeDef dmainit;
    uint32_t tmpreg1 = 0U;

    if (err != ETH_SUCCESS) /* Auto-negotiation failed */
    {
        /* Set Ethernet duplex mode to Full-duplex */
        (heth->Init).DuplexMode = ETH_MODE_FULLDUPLEX;

        /* Set Ethernet speed to 100M */
        (heth->Init).Speed = ETH_SPEED_100M;
    }

