Ivansquark/stm32_proj/f407/f407_httpd/hal/src/stm32f4xx_hal_eth.cpp
    /* Enable the MAC transmission */
    (heth->Instance)->MACCR |= ETH_MACCR_TE;

    /* Wait until the write operation will be taken into account:
       at least four TX_CLK/RX_CLK clock cycles */
    tmpreg1 = (heth->Instance)->MACCR;
    ETH_Delay(ETH_REG_WRITE_DELAY);
    (heth->Instance)->MACCR = tmpreg1;
}

/**
 * @brief  Disables the MAC transmission.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval None
 */
static void ETH_MACTransmissionDisable(ETH_HandleTypeDef *heth) {
    __IO uint32_t tmpreg1 = 0U;

    /* Disable the MAC transmission */
    (heth->Instance)->MACCR &= ~ETH_MACCR_TE;

    /* Wait until the write operation will be taken into account:
       at least four TX_CLK/RX_CLK clock cycles */
    tmpreg1 = (heth->Instance)->MACCR;
    ETH_Delay(ETH_REG_WRITE_DELAY);
    (heth->Instance)->MACCR = tmpreg1;
}

/**
 * @brief  Enables the MAC reception.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval None
 */
static void ETH_MACReceptionEnable(ETH_HandleTypeDef *heth) {
    __IO uint32_t tmpreg1 = 0U;

    /* Enable the MAC reception */
    (heth->Instance)->MACCR |= ETH_MACCR_RE;

    /* Wait until the write operation will be taken into account:
       at least four TX_CLK/RX_CLK clock cycles */
    tmpreg1 = (heth->Instance)->MACCR;
    ETH_Delay(ETH_REG_WRITE_DELAY);
    (heth->Instance)->MACCR = tmpreg1;
}

/**
 * @brief  Disables the MAC reception.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval None
 */
static void ETH_MACReceptionDisable(ETH_HandleTypeDef *heth) {
    __IO uint32_t tmpreg1 = 0U;

    /* Disable the MAC reception */
    (heth->Instance)->MACCR &= ~ETH_MACCR_RE;

    /* Wait until the write operation will be taken into account:
       at least four TX_CLK/RX_CLK clock cycles */
    tmpreg1 = (heth->Instance)->MACCR;
    ETH_Delay(ETH_REG_WRITE_DELAY);
    (heth->Instance)->MACCR = tmpreg1;
}

/**
 * @brief  Enables the DMA transmission.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval None
 */
static void ETH_DMATransmissionEnable(ETH_HandleTypeDef *heth) {
    /* Enable the DMA transmission */
    (heth->Instance)->DMAOMR |= ETH_DMAOMR_ST;
}

/**
 * @brief  Disables the DMA transmission.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval None
 */
static void ETH_DMATransmissionDisable(ETH_HandleTypeDef *heth) {
    /* Disable the DMA transmission */
    (heth->Instance)->DMAOMR &= ~ETH_DMAOMR_ST;
}

/**
 * @brief  Enables the DMA reception.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval None
 */
static void ETH_DMAReceptionEnable(ETH_HandleTypeDef *heth) {
    /* Enable the DMA reception */
    (heth->Instance)->DMAOMR |= ETH_DMAOMR_SR;
}

/**
 * @brief  Disables the DMA reception.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval None
 */
static void ETH_DMAReceptionDisable(ETH_HandleTypeDef *heth) {
    /* Disable the DMA reception */
    (heth->Instance)->DMAOMR &= ~ETH_DMAOMR_SR;
}

/**
 * @brief  Clears the ETHERNET transmit FIFO.
 * @param  heth pointer to a ETH_HandleTypeDef structure that contains
 *         the configuration information for ETHERNET module
 * @retval None
 */
static void ETH_FlushTransmitFIFO(ETH_HandleTypeDef *heth) {
    __IO uint32_t tmpreg1 = 0U;

    /* Set the Flush Transmit FIFO bit */
    (heth->Instance)->DMAOMR |= ETH_DMAOMR_FTF;

    /* Wait until the write operation will be taken into account:
       at least four TX_CLK/RX_CLK clock cycles */
    tmpreg1 = (heth->Instance)->DMAOMR;
    ETH_Delay(ETH_REG_WRITE_DELAY);
    (heth->Instance)->DMAOMR = tmpreg1;
}

/**
 * @brief  This function provides delay (in milliseconds) based on CPU cycles method.
 * @param  mdelay specifies the delay time length, in milliseconds.
 * @retval None
 */
static void ETH_Delay(uint32_t mdelay) {
    __IO uint32_t Delay = mdelay * (SystemCoreClock / 8U / 1000U);
    do {
        __NOP();
    } while (Delay--);
}

#if (USE_HAL_ETH_REGISTER_CALLBACKS == 1)
static void ETH_InitCallbacksToDefault(ETH_HandleTypeDef *heth) {
    /* Init the ETH Callback settings */
    heth->TxCpltCallback = HAL_ETH_TxCpltCallback;  /* Legacy weak TxCpltCallback   */
    heth->RxCpltCallback = HAL_ETH_RxCpltCallback;  /* Legacy weak RxCpltCallback   */
    heth->DMAErrorCallback = HAL_ETH_ErrorCallback; /* Legacy weak DMAErrorCallback */
}
#endif /* USE_HAL_ETH_REGISTER_CALLBACKS */

/**
 * @}
 */

#endif /* STM32F405xx || STM32F415xx || STM32F407xx || STM32F417xx || STM32F427xx ||                                   \
          STM32F437xx || STM32F429xx || STM32F439xx || STM32F469xx || STM32F479xx */
#endif /* HAL_ETH_MODULE_ENABLED */
/**
 * @}
 */

/**
 * @}
 */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
